{
  "conversation": [
    {"coach": "Hello! Welcome to our coaching session. Tell me a bit about your golf background."},
    {"athlete": "Hi coach! I have been playing golf for about seven years."},
    {"coach": "That is fantastic! What is your current handicap?"}, 
    {"athlete": "I am currently at a nine handicap."},
    {"coach": "Nice work! Which club do you feel most confident using on the course?"}, 
    {"athlete": "I feel really good with my driver. I can get some good distance with it."},
    {"coach": "That is great to hear. What do you think is the weakest part of your game right now?"}, 
    {"athlete": "My chipping needs a lot of improvement. I often leave myself with tough putts after my chips."},
    {"coach": "Chipping can be tricky. How do you usually feel when you are under pressure, like in a tight match?"}, 
    {"athlete": "I get quite anxious. I tend to rush my shots, which does not help."},
    {"coach": "That is common for many players. Do you have a specific routine before you take a shot?"}, 
    {"athlete": "I try to focus, but I do not have a consistent pre-shot routine."},
    {"coach": "Establishing a routine could really help. Are you currently following any fitness regimen to support your game?"}, 
    {"athlete": "I do not have one at the moment, but I think I should work on my overall fitness."},
    {"coach": "What is your main goal for your golf game moving forward?"}, 
    {"athlete": "I would love to get down to a five handicap and compete in local tournaments."},
    {"coach": "That is an exciting goal! How much time can you dedicate to practice each week?"}, 
    {"athlete": "I can usually manage about six hours per week for practice and playing."}
  ],
 "assessment": {
    "years_playing": 7,
    "current_handicap": "9",
    "rounds_per_month": null,
    "home_course": null,
    "previous_instruction": false,
    "strongest_club": "driver",
    "weakest_area": "chipping",
    "driving_accuracy": "Good",
    "short_game_confidence": "Somewhat Confident",
    "putting_consistency": null,
    "pre_shot_routine": false,
    "pressure_handling": "gets anxious and rushes shots",
    "course_strategy": null,
    "mental_toughness": null,
    "flexibility": null,
    "fitness_routine": false,
    "injuries_limitations": null,
    "stamina_endurance": null,
    "primary_goal": "get down to a five handicap and compete",
    "target_handicap": "5",
    "motivation_level": "Very Motivated",
    "practice_time": "6 hours per week",
    "competitive_interest": true
  }
}